src/cf/Catalogs/СегментыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СегментыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновляемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенныйРежимРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаПеренесеныНаНовуюСхему</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьИспользуемыеПравила</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючДинамическогоПравила</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СоставСегментаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоставСегментаКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СегментДляСписка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РеквизитыДляСписка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДобавленияВСегмент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СпособыДобавленияВСегмент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыДобавленияВСегмент</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПравилам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СегментыКонтрагентов/Forms/ДобавлениеКонтрагентовВСегменты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивКонтрагентов = Новый Массив;
	Параметры.Свойство("МассивКонтрагентов",МассивКонтрагентов);
    ЗаполнитьПолучателей(МассивКонтрагентов);

	ЦветТекущегоШага = ЦветаСтиля.ЦветФонаПодсказки;
	ЦветШага         = ЦветаСтиля.ЦветФонаФормы;
	
	ТекущийШаг = 1;

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ДекорацияПодготовкаСпискаКонтрагентовНажатие(Элемент)

	ТекущийШаг = 1;
	УправлениеФормой();
	
КонецПроцедуры   

&НаКлиенте
Процедура ДекорацияВыборСегментовКонтрагентовНажатие(Элемент)
	
	ТекущийШаг = 2;
	УправлениеФормой();
	
КонецПроцедуры   

&НаКлиенте
Процедура СегментыКонтрагентовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыборСегментаСервер(ВыбранноеЗначение);
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура СегментыКонтрагентовПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	Для Каждого Строка Из Контрагенты Цикл
		Строка.Пометка = Истина;	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)

	Для Каждого Строка Из Контрагенты Цикл
		Строка.Пометка = Ложь;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходКоВторомуШагу(Команда)

	ТекущийШаг = 2;
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходКПервомуШагу(Команда)

	ТекущийШаг = 1;
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСегмент(Команда) 

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.СегментыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элементы.СегментыКонтрагентов,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСегмент(Команда)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.СегментыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элементы.СегментыКонтрагентов,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыбор(Команда)

	Если СегментыКонтрагентов.Количество() = 0 Тогда
		Закрыть();
		Возврат;
	КонецЕсли;         
	
	КоличествоСтрокКонтрагентовСПометкой = Контрагенты.НайтиСтроки(Новый Структура("Пометка",Истина)).Количество();
	Если КоличествоСтрокКонтрагентовСПометкой = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Не выбрано ни одного контрагента'"));
		Возврат;
	КонецЕсли;
	
	ВыбраныНедоступныеСегменты = Ложь;
	Для Каждого СтрокаСегмент Из СегментыКонтрагентов Цикл
		Сегмент = СтрокаСегмент.Сегмент;
		РазрешеноРедактированиеСегмента = ПроверитьДоступностьСегмента(Сегмент);
		Если РазрешеноРедактированиеСегмента <> Истина Тогда  
			ТекстШаблона = НСтр("ru = 'Сегмент %1 используется для предоставления скидки. Для редактирования состава сегмента обратитесь к администратору'");
			СтрокаШаблон = СтрШаблон(ТекстШаблона, Сегмент);
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаШаблон); 
			ВыбраныНедоступныеСегменты = Истина;
		КонецЕсли;
	КонецЦикла;   
	
	Если ВыбраныНедоступныеСегменты = Истина Тогда
		Возврат;
	КонецЕсли;    
	
	МассивОбработаноСегментов = Новый Массив;
	ДобавитьКонтрагентовВСегменты(МассивОбработаноСегментов);
	
	СтрокаИзменено = СтрокаСЧислом(
		НСтр("ru=';Добавлены контрагенты в %1 сегмент;;Добавлены контрагенты в %1 сегмента;Добавлены контрагенты %1 сегментов;Добавлены контрагенты в %1 сегмента'"),
		Строка(МассивОбработаноСегментов.Количество()),
		ВидЧисловогоЗначения.Количественное);
		
	Если МассивОбработаноСегментов.Количество() = 1 Тогда
		СсылкаНаСегмент = ПолучитьНавигационнуюСсылку(МассивОбработаноСегментов[0]);
	КонецЕсли;

	Если МассивОбработаноСегментов.Количество() = 0 Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	
	ОповещениеСпискаСегментов = Новый ОписаниеОповещения("ОткрытьСписокСегментовПоОповещению", ЭтотОбъект, МассивОбработаноСегментов);
	ПоказатьОповещениеПользователя(
		НСтр("ru='Изменение:'"), ?(МассивОбработаноСегментов.Количество() = 1, СсылкаНаСегмент, ОповещениеСпискаСегментов),
		?(МассивОбработаноСегментов.Количество() = 1,Строка(МассивОбработаноСегментов[0]), СтрокаИзменено),
		БиблиотекаКартинок.Информация32);
		
	Закрыть();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеФормой()
	
	Если ТекущийШаг = 1 Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ВыборКонтрагентов;
	КонецЕсли;
	
	Если ТекущийШаг = 2 Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ВыборСегментов;
	КонецЕсли;
	
	Если ТекущийШаг = 1 Тогда
		Элементы.Шаг1.ЦветФона = ЦветТекущегоШага;
		Элементы.Шаг2.ЦветФона = ЦветШага; 
		Элементы.ПереходКоВторомуШагу.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.Шаг1.ЦветФона = ЦветШага;
		Элементы.Шаг2.ЦветФона = ЦветТекущегоШага;      
		Элементы.ЗавершитьВыбор.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Элементы.СтрокаСостоянияВыбораКонтрагентов.Заголовок = СтрокаСостоянияВыбораСегментов();   
	
	ШаблонЗаголовок = НСтр("ru = 'Добавление контрагентов в сегменты (Шаг %1/2)'");            
	СтрокаШаблон = СтрШаблон(ШаблонЗаголовок, ТекущийШаг);
	ЭтотОбъект.Заголовок = СтрокаШаблон;

КонецПроцедуры

&НаКлиенте
Функция СтрокаСостоянияВыбораСегментов()
	
	Если СегментыКонтрагентов.Количество() = 0 Тогда
		Возврат НСтр("ru ='Не выбрано ни одного сегмента'");
	КонецЕсли;
	
	СтрокаСостояния = "";  
	КоличествоСтрокКонтрагентовСПометкой = Контрагенты.НайтиСтроки(Новый Структура("Пометка",Истина)).Количество();
	Если КоличествоСтрокКонтрагентовСПометкой = 0 Тогда
		Возврат НСтр("ru ='Не выбрано ни одного контрагента'");
	КонецЕсли;

	СтрокаКонтрагенты = СтрокаСЧислом(
		НСтр("ru=';Будет добавлен %1 контрагент;;Будет добавлено %1 контрагента;Будет добавлено %1 контрагентов;Будет добавлено %1 контрагента'"),
		Строка(КоличествоСтрокКонтрагентовСПометкой),
		ВидЧисловогоЗначения.Количественное);
		
	СтрокаСегментов = СтрокаСЧислом(
		НСтр("ru=';в %1 сегмент;;в %1 сегмента;в %1 сегментов;в %1 сегмента'"),
		Строка(СегментыКонтрагентов.Количество()),
		ВидЧисловогоЗначения.Количественное);
		
	СтрокаСостояния = СтрокаКонтрагенты + Символы.НПП + СтрокаСегментов;
	
	Возврат СтрокаСостояния;
	
КонецФункции  

&НаКлиенте
Процедура ОткрытьСписокСегментовПоОповещению(ДополнительныеПараметры) Экспорт

	ПараметрыФормы = Новый Структура("Отбор",Новый Структура("Ссылка", ДополнительныеПараметры));
	ОткрытьФорму("Справочник.СегментыКонтрагентов.ФормаСписка",ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолучателей(МассивКонтрагентов)
	
	Если ТипЗнч(МассивКонтрагентов) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЭтоГруппа = ЛОЖЬ
		|	И Контрагенты.Ссылка В (&МассивКонтрагентов)";
	
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
	
	Выборка =  Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаКонтрагенты = Контрагенты.Добавить();
		СтрокаКонтрагенты.Пометка = Истина;
		СтрокаКонтрагенты.Значение = Выборка.Контрагент;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКонтрагентовВСегменты(МассивОбработаноСегментов)
	
	УстановитьПривилегированныйРежим(Истина);	
	КоличествоДобавленныхПолучателей = 0;
	КонтрагентыВыбранные = Контрагенты.Выгрузить(Новый Структура("Пометка",Истина)).ВыгрузитьКолонку("Значение");		
	Для Каждого СтрокаСегмент Из СегментыКонтрагентов Цикл
		
		Сегмент = СтрокаСегмент.Сегмент;
		РазрешеноРедактированиеСегмента = РаботаССегментами.РазрешеноРедактированиеСегментаКонтрагентов(Сегмент);
		Если РазрешеноРедактированиеСегмента <> Истина Тогда  
			ТекстШаблона = НСтр("ru = 'Сегмент %1 используется для предоставления скидки. Для редактирования состава сегмента обратитесь к администратору'");
			СтрокаШаблон = СтрШаблон(ТекстШаблона, Сегмент);
			ОбщегоНазначения.СообщитьПользователю(СтрокаШаблон);
        	Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Сегмент) Тогда
	   		Продолжить;
		КонецЕсли;		
		
		НачатьТранзакцию();
		
		Попытка  
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СоставСегментаКонтрагентов");
			ЭлементБлокировки.УстановитьЗначение("Сегмент",Сегмент);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			Блокировка.Заблокировать();
			ОбъектСегмент = Сегмент.ПолучитьОбъект();
			ОбъектСегмент.Заблокировать();
			
			КонтрагентыКДобавлению = ПолучитьМассивКонтрагентовКДобавлениюВСегмент(КонтрагентыВыбранные,Сегмент);
            РегистрыСведений.СоставСегментаКонтрагентов.ОбновитьСоставВыбранногоСегментаВручную(Сегмент,КонтрагентыКДобавлению);
					
			ОбъектСегмент.Разблокировать();
			МассивОбработаноСегментов.Добавить(Сегмент);
			ЗафиксироватьТранзакцию();
			
		Исключение        
			
			ОтменитьТранзакцию();     
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='ДобавлениеКонтрагентовВСегменты'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
			УстановитьПривилегированныйРежим(Ложь);	
			ТекстСообщения = НСтр("ru='В процессе добавления контрагентов в сегменты произошла следующая ошибка: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки);
			ВызватьИсключение ТекстСообщения;
			
		КонецПопытки;

				
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

&НаСервере
Процедура ВыборСегментаСервер(Знач ВыбранноеЗначение)
	
	Если (ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() = 0)
		ИЛИ (НЕ ЗначениеЗаполнено(ВыбранноеЗначение) И ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СегментыКонтрагентов")) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстШаблона = НСтр("ru = 'Сегмент %1 используется для предоставления скидки. Для редактирования состава сегмента обратитесь к администратору'");
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СегментыКонтрагентов") Тогда
		
		СегментУжеВыбран = СегментыКонтрагентов.НайтиСтроки(Новый Структура("Сегмент", ВыбранноеЗначение));
		Если СегментУжеВыбран.Количество() <> 0 Тогда
			Возврат;
		КонецЕсли;  
		
		РазрешеноРедактированиеСегмента = РаботаССегментами.РазрешеноРедактированиеСегментаКонтрагентов(ВыбранноеЗначение);
		Если РазрешеноРедактированиеСегмента <> Истина Тогда  
			СтрокаШаблон = СтрШаблон(ТекстШаблона, ВыбранноеЗначение);
			ОбщегоНазначения.СообщитьПользователю(СтрокаШаблон);
			Возврат;
		КонецЕсли;
		
		НоваяСтрока = СегментыКонтрагентов.Добавить();
		НоваяСтрока.Сегмент = ВыбранноеЗначение;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для Каждого Сегмент Из ВыбранноеЗначение Цикл
			СегментУжеВыбран = СегментыКонтрагентов.НайтиСтроки(Новый Структура("Сегмент", Сегмент));
			Если СегментУжеВыбран.Количество() <> 0 Тогда
				Возврат;
			КонецЕсли;
			
			РазрешеноРедактированиеСегмента = РаботаССегментами.РазрешеноРедактированиеСегментаКонтрагентов(Сегмент);
			Если РазрешеноРедактированиеСегмента <> Истина Тогда
				СтрокаШаблон = СтрШаблон(ТекстШаблона, Сегмент);
				ОбщегоНазначения.СообщитьПользователю(СтрокаШаблон);
				Возврат;
			КонецЕсли;  
			
			НоваяСтрока = СегментыКонтрагентов.Добавить();
			НоваяСтрока.Сегмент = Сегмент;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивКонтрагентовКДобавлениюВСегмент(КонтрагентыВыбранные,Сегмент)
	
	// АПК:96-выкл В данном случае требуется получить именно различных контрагентов без пересечений из двух источников
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ  
	|	Контрагенты.Ссылка <> Значение(Справочник.Контрагенты.ПустаяСсылка)
	|	И Контрагенты.Ссылка В (&МассивКонтрагентов)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СоставСегментаКонтрагентов.Контрагент
	|ИЗ
	|	РегистрСведений.СоставСегментаКонтрагентов КАК СоставСегментаКонтрагентов
	|ГДЕ
	|	СоставСегментаКонтрагентов.Сегмент = &Сегмент
	|	И СоставСегментаКонтрагентов.СпособДобавления = &СпособДобавления";
	// АПК:96-вкл
	
	Запрос.УстановитьПараметр("МассивКонтрагентов", КонтрагентыВыбранные);
	Запрос.УстановитьПараметр("Сегмент", Сегмент);
	Запрос.УстановитьПараметр("СпособДобавления", Перечисления.СпособыДобавленияВСегмент.Вручную);  
	
    Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПроверитьДоступностьСегмента(Знач Сегмент)
		
    Возврат РаботаССегментами.РазрешеноРедактированиеСегментаКонтрагентов(Сегмент);
	
КонецФункции	

#КонецОбласти
